Revit 2027 API
MacroModule.Environment Property
 The Macro environment.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroEnvironment Environment { get; }
Public ReadOnly Property Environment As MacroEnvironment
	Get
public:
property MacroEnvironment Environment {
	MacroEnvironment get ();
}
member Environment : MacroEnvironment with get
Property Value
MacroEnvironment
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace